<template>
  <section class="main-content columns is-fullheight">
    <aside class="column is-3 is-narrow-mobile is-fullheight section">
      <h1 class="title is-3">{{ course.name }}</h1>
      <ul class="menu-list">
        <li
          @click="sectionChanged(effect.id)"
          v-for="section in course.sections"
          :key="section.id"
        >
          <a :class="[section.isActive && 'is-active']">{{ section.name }}</a>
        </li>
      </ul>
    </aside>
    <div class="column">
      <div class="columns">
        <div class="column">
          <h1 class="title is-1">Что такое HTML</h1>
        </div>
      </div>
      <div class="columns is-9">
        <div class="column">
          <div class="content has-text-justified">
            <p>
              HTML (HyperText Markup Language) — язык разметки (маркировки)
              гипертекста. Гипертекст своим развитием обязан интернету, хоть и
              создавался он совсем не для того. HTML дает возможность
              производить переход от одной части текста к другой, и, что
              замечательно, эти части могут храниться на совершенно разных
              компьютерах. HTML не стоит путать с языками программирования, он
              создан специально для разметки вэб-страниц. Именно язык разметки
              дает браузеру необходимые инструкции о том, как отображать тексты
              и другие элементы страницы на мониторе. Важно заметить, что не
              только различные браузеры, но и различные их версии могут
              по-разному воспринимать и отображать на экране код. Следовательно,
              некоторые элементы корректно выглядящие в браузере Operа могут
              выглядеть иначе в Internet Explorer и других браузерах. При
              верстке (грубо говоря, создании страниц) HTML-страниц это
              необходимо помнить, и просматривать их в самых популярных
              браузерах типа Mozilla Firefox, Internet Explorer и Operа. Код
              разметки в HTML состоит из так называемых «тегов». Теги
              предоставляют информацию браузерам о форматировании и разметке
              страницы. Название тега заключается в угловые скобки «&lt;» и
              «&gt;». Некоторые тэги бывают открывающимися и закрывающимися,
              например, тег b, который делает текст жирным.
            </p>
            <div class="highlited">
              <pre><code>&lt;b&gt;Текст&lt;/b&gt; - текст, заключенный между &lt;b&gt; и &lt;/b&gt;</code></pre>
            </div>
            <p>
              будет выделен жирным. Они влияют на отображение содержимого,
              находящегося в нем. Данные, находящиеся между такими символами,
              называются содержимым тега. Иногда встречаются теги, являющиеся
              одновременно и закрывающими и открывающими, например hr — линия:
            </p>

            <div class="has-text-white">
              <hr />
            </div>

            <p>
              Чтобы писать на HTML надо его просто знать. Однако, учитывая
              огромную популярность Интернета, и огромное количество
              пользователей, желающих сделать свои странички, было создано
              множество редакторов, упрощающих работу с кодом. Один из самых
              простых из них – это FrontPage, входящий в пакет Microsoft Office.
              Это программное обеспечение (ПО) достаточно просто в обращении. И
              все же FrontPage имеет ряд существенных минусов: засоряет страницы
              (до 70% лишнего кода), снижает быстродействие, имеет ограниченные
              возможности дизайна.
            </p>

            <p>
              Более продвинутые редакторы – HomeSite и DreamWeaver. Они помогут
              создать как сайт-визитку, так и настоящий шедевр современного
              искусства. К минусам этого ПО можно отнести: долгую обработку
              массивного кода и небольшое засорение кода лишними тегами.
              Требуется знание HTML в этом случае на порядок-два выше, чем при
              работе с FrontPage. Наконец, высший пилотаж – это написание
              страниц в Блокноте. Работает быстро и легко. Некоторые веб-мастера
              (особенно старой закалки) работают с ним. Большинство же
              предпочитают ПО уровня DreamWeaver и выше. Для работы с html
              страницами я использую программу PHP Desigber 2008, также неплохой
              программой – редактором является Notepad ++. Моя персональная
              рекомендация всем: учите html. Это очень простой «язык» и изучить
              его можно в короткие сроки. Не обязательно в точности запоминать
              все теги, важно хотя бы понимать их назначение. Тогда можно легко
              форматировать текст и изменять html страницы. Есть сайт, который
              мне постоянно помогал в изучении HTML — это сайт htmlbook.ru. На
              сайте есть полезный раздел — HTML по шагам. С него и можно начать
              изучение.
            </p>
          </div>
        </div>
      </div>
    </div>
  </section>
</template>
<script lang='ts'>
import { Vue, Component } from "vue-property-decorator";

@Component({})
export default class extends Vue {
  private course = {
    name: "Основы HTML",
    sections: [
      { isActive: true, id: 1, name: "Что такое HTML", text: "" },
      { isActive: false, id: 2, name: "HTML-теги", text: "" },
      { isActive: false, id: 3, name: "Вложенные теги", text: "" },
      { isActive: false, id: 4, name: "Аттрибуты тегов", text: "" },
      { isActive: false, id: 5, name: "HTML 5", text: "" }
    ]
  };
}
</script>
<style lang='scss'>
</style>