<template>
  <section class="hero has-background is-fullheight-with-navbar">
    <div class="hero-body has-mask">
      <div class="container">
        <div class="columns">
          <div class="column">
            <h1 class="title is-1 has-text-white">О сайте</h1>
          </div>
        </div>

        <div class="columns">
          <div class="column">
            <div class="content has-text-white">
              Данный сайт является дипломным проектом, который направлен на
              предоставление необходимой информации для обучения начинающим
              веб-дизайнерам, а также возможность попрактиковаться в своих
              знаниях. Сайт содержит следующую информацию:
              <ul>
                <li>
                  Библиотека эффектов – страница, где можно найти нужный эффект
                  для оформления своего сайта, посмотреть, как он выглядит
                  визуально, а также узнать код эффекта с помощью редактора
                  кода.
                </li>
                <li>
                  Ресурсы – страница содержит ссылки на сайты, где можно найти
                  более подробную и интересную информацию.
                </li>
                <li>
                  Среды разработки и редакторы предоставят Вам информацию, в
                  каких средах можно работать с кодом, а редакторы могут
                  потребоваться при разработке дизайна сайта.
                </li>
                <li>
                  Курсы помогут улучшить свои знания и закрепить их с помощью
                  прохождения теста.
                </li>
                <li>
                  Редактор кода – страница, на которой можно писать код онлайн и
                  видеть результат его выполнения.
                </li>
              </ul>
            </div>
          </div>
        </div>
      </div>
    </div>
  </section>
</template>


