<template>
  <div class="main-content is-fullheight">
    <div class="columns">
      <aside class="column is-3 is-narrow-mobile is-fullheight section ">
        <ul class="menu-list">
          <li>
            <a @click="setFalse" :class="[!editorIsActive && 'is-active']"
              >Среды разработки</a
            >
          </li>
          <li>
            <a @click="setTrue" :class="[editorIsActive && 'is-active']"
              >Редакторы</a
            >
          </li>
        </ul>
      </aside>

      <div class="column is-9">
        <div v-if="!editorIsActive" class="section">
          <div class="columns">
            <div class="column">
              <h4 class="title is-4">
                Среды разработки
              </h4>
            </div>
          </div>
          <div class="columns">
            <div class="column">
              <div class="content">
                <ol>
                  <li v-for="e in env" :key="e.name">
                    <p>{{ e.name }}</p>
                    <p>{{ e.desc }}</p>
                  </li>
                </ol>
              </div>
            </div>
          </div>
        </div>
        <div v-else class="section">
          <div class="columns">
            <div class="column">
              <h4 class="title is-4">
                Редакторы
              </h4>
            </div>
          </div>
          <div class="columns">
            <div class="column">
              <div class="content">
                <ol>
                  <li v-for="editor in editors" :key="editor.name">
                    <span>{{ editor.name }}</span>
                    <p>{{ editor.description }}</p>
                    <ul>
                      <li v-for="item in editor.items" :key="item.name">
                        <a :href="item.link">{{ item.name }}</a>
                        <p>{{ item.descr }}</p>
                      </li>
                    </ul>
                  </li>
                </ol>
              </div>
            </div>
          </div>
        </div>
      </div>
    </div>
  </div>
</template>

<script lang='ts'>
import { Vue, Component } from "vue-property-decorator";

@Component({})
export default class extends Vue {
  private editorIsActive = false;

  private setTrue() {
    this.editorIsActive = true;
  }
  private setFalse() {
    this.editorIsActive = false;
  }

  private env = [
    {
      name: "Notepad++",
      desc:
        "Свободный текстовый редактор с открытым исходным кодом для Windows с подсветкой синтаксиса большого количества языков программирования и разметки."
    },
    {
      name: "Visual Studio Code",
      desc:
        "Редактор исходного кода, разработанный Microsoft для Windows, Linux и macOS.  Позиционируется как «лёгкий» редактор кода для кроссплатформенной разработки веб- и облачных приложений.  Включает в себя отладчик, инструменты для работы с Git, подсветку синтаксиса, IntelliSense и  средства для рефакторинга. Имеет широкие возможности для кастомизации: пользовательские темы,  сочетания клавиш и файлы конфигурации. Распространяется бесплатно, разрабатывается как программное  обеспечение с открытым исходным кодом, но готовые сборки распространяются под проприетарной лицензией."
    },
    {
      name: "XCode",
      desc:
        "IDE, ориентированная на создание приложений для OS X и iOS. Для использования языков  Objective C и Swift на сегодня это лучшее, а для некоторых задач и вовсе единственное решение."
    },
    {
      name: "IntelliJ IDEA",
      desc:
        "IDE, разработанная компанией JetBrains, позволяющая создавать программы на множестве популярных языков, среди которых Java, JavaScript, Python, Ruby, Groovy, Scala, PHP, C, C++"
    },
    {
      name: "Eclipse",
      desc:
        "Cреда разработки, изначально ориентированная на работу с Java, прославилась большим количеством внешних модулей, существенно расширяющих её функциональность (в том числе, это касается количества поддерживаемых языков)"
    },
    {
      name: "Netbeans",
      desc:
        "Мощная IDE для разработки приложений на Java, JavaScript, Python, PHP, C, C++ и даже Ада."
    },
    {
      name: "PhoneGap",
      desc:
        "Необычная среда разработки кроссплатформенных приложений, не требующая знания «родных» языков. То есть для того, чтобы создать приложение для Android, знание Java вам не потребуется. Используются JavaScript в связке с HTML5 и CSS3."
    }
  ];

  private editors = [
    {
      name: "Векторные редакторы",
      description:
        "Они предназначены для создания и редактирования логотипов, интерфейсов и прочей масштабируемой графики",
      items: [
        {
          name: "Gravit Designer",
          link: "https://www.designer.io/en/",
          descr:
            "Он подходит для любых задач: от дизайна интерфейсов и иконок до работы с презентациями, иллюстрациями и анимацией.Редактор содержит массу инструментов для создания прекрасных детализированных векторных изображений. Среди них — неразрушающие (их действие можно отменять) функции для работы с булевыми операциями, инструменты «Нож» и «Граф путей» плюс множество режимов заливки и смешивания, а также мощный текстовый движок.Если вам понадобится получить доступ к работе на ходу, облачный сервис Gravit Cloud позволит вернуться к проекту на любом устройстве.Платформы: веб, Windows, macOS, Linux."
        },
        {
          name: "Vectr",
          link: "https://vectr.com/",
          descr:
            "Vectr предлагает все функции, которые только могут понадобиться для создания векторной графики, плюс множество опций для использования фильтров, теней и шрифтов. Этого хватит, чтобы справиться с большинством повседневных дизайнерских задач. Особенно полезны возможности совместного редактирования и синхронизации, благодаря которым можно работать когда и где угодно в тандеме с другими людьми.Платформы: веб, Windows, macOS, Linux."
        },
        {
          name: "SVG-Edit",
          link: "http://www.clker.com/inc/svgedit/svg-editor.html",
          descr:
            "Это онлайн-редактор. Код SVG-Edit открыт. Поэтому при желании вы можете скачать его и модифицировать, чтобы создать свою версию редактора.SVG-Edit располагает всеми базовыми инструментами векторного редактора.Платформы: веб."
        },
        {
          name: "Inkscape",
          link: "https://inkscape.org/ru/release/inkscape-0.92.4/",
          descr:
            "Этот мощный редактор предлагает множество инструментов и функций, которые часто недоступны в других аналогичных программах. Среди них — альфа-смешивание, клонирование объектов и маркеры.Полная поддержка различных цветовых моделей делает Inkscape достойной альтернативой Adobe Illustrator как для веб-дизайна, так и в сфере полиграфии. При всей простоте интерфейса в этой программе можно создавать невероятно комплексные работы.Платформы: Windows, macOS, Linux."
        }
      ]
    },
    {
      name: "Растровые редакторы",
      description:
        "Предназначены для создания и редактирования любых немасштабируемых рисунков и фотографий",
      items: [
        {
          name: "GIMP",
          link: "https://www.gimp.org/",
          descr:
            "Бесплатный графический редактор с открытым исходным кодом. GIMP укомплектован богатым набором функций для рисования, цветокоррекции, клонирования, выделения, улучшений и других действий. Интерфейсом GIMP отличается от популярнейшего Photoshop, но долго искать нужные инструменты вам не придётся.Платформы: Windows, macOS, Linux."
        },
        {
          name: "Photo Pos Pro",
          link: "https://www.photopos.com/PPP3_BS/Default.aspx",
          descr:
            "Создан с прицелом на редактирование изображений и отлично справляется с типичными задачами вроде регулировки контрастности, освещения и насыщенности.Платформы: Windows."
        },
        {
          name: "Krita",
          link: "https://krita.org/en/",
          descr:
            "Программа включает набор самых разных кистей и поддерживает множество плагинов: от продвинутых фильтров до вспомогательных инструментов для работы с перспективой.В числе самых интересных функций — стабилизаторы кистей, которые сглаживают линии, режим зацикливания для создания бесшовных паттернов и текстур, а также всплывающая палитра для быстрого выбора цвета.Платформы: Windows, macOS, Linux."
        },
        {
          name: "Pixlr",
          link: "https://pixlr.com/",
          descr:
            "Pixlr предлагает более 600 эффектов, наложений и рамок. В этом сервисе можно делать всё, чего стоит ждать от фоторедактора: изменять размер изображений, обрезать их, удалять эффект красных глаз, отбеливать зубы и многое другое.Платформы: веб, iOS, Android."
        },
        {
          name: "Paint.NET",
          link: "https://www.getpaint.net/",
          descr:
            "Paint.NET является альтернативой программе Paint.Команда разработки делает упор на простоту использования и совершенствует в Paint.NET скорее функции для редактирования снимков, чем возможности дизайна графики. Тем не менее Paint.NET позволяет управлять перспективой, манипулировать пикселями на холсте, клонировать выделенные зоны и так далее.Платформы: Windows."
        },
        {
          name: "Sumo Paint",
          link: "https://www.sumopaint.com/",
          descr:
            "Арсенал настроек и функций Sumo Paint включает карандаши, кисти, текст, градиенты, клонирование, формы и не только. Платформы: веб."
        }
      ]
    },
    {
      name: "Редакторы 3D - графики",
      description:
        "Предназначены для работы с 3D-моделями, эффектами и анимациями",
      items: [
        {
          name: "SketchUp Free",
          link: "https://www.sketchup.com/plans-and-pricing/sketchup-free",
          descr:
            "SketchUp Free можно назвать идеальной точкой входа в мир 3D-графики. Этот редактор дружелюбно вводит новичка в курс дела и прощает ему все допущенные ошибки. Вы можете начать с простого рисования линий и форм, а потом преобразить их в 3D-объекты.Платформы: веб."
        },
        {
          name: "Daz Studio",
          link: "https://www.daz3d.com/get_studio",
          descr:
            "С помощью Daz Studio можно кастомизировать, перемещать в пространстве и анимировать различные 3D-объекты вроде людей, животных, предметов.Вы можете создавать уникальных персонажей, миры, различные элементы дизайна и многое другое. Платформы: Windows, macOS."
        },
        {
          name: "Blender",
          link: "https://www.blender.org/",
          descr:
            "Blender — это продвинутый бесплатный редактор 3D-графики с открытым исходным кодом, доступный для всех основных платформ.Он поддерживает все возможные операции с 3D-графикой: позволяет моделировать, текстурировать, анимировать, рендерить и компоновать.Платформы: Windows, macOS, Linux."
        },
        {
          name: "Sculptris",
          link: "http://pixologic.com/sculptris/",
          descr:
            "Если вам интересно искусство цифровой скульптуры, попробуйте программу Sculptris от разработчика Pixologic. Она подходит одинаково хорошо для любого уровня подготовки. Новички получают хороший стартовый инструмент, а уже опытные цифровые художники — платформу для быстрой и удобной реализации идей.Платформы: Windows, macOS."
        },
        {
          name: "Houdini Apprentice",
          link: "https://www.sidefx.com/products/houdini-apprentice/",
          descr:
            "Houdini — инструмент для работы с 3D-анимацией и визуальными эффектами, который часто используют при работе над фильмами, телепередачами и другим медиаконтентом.Платформы: Windows, macOS, Linux."
        }
      ]
    }
  ];
}
</script>
<style lang='scss'>
</style>